Merge pull request #139 from All-Circuits-Technologies/132-add-docs-and-tests-to-the-feature-managers
132 add tests and docs to the feature managers
